---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.VoltageIsOutOfRange
source: html/3a161382-e2bc-e5af-09fb-494107f37b47.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.VoltageIsOutOfRange Property

Cannot assign or add [Element] to Circuit. The Voltage ([Voltage Value]) for the Circuit is out of range for the Line to Ground Voltage for [Element] (The Line to Ground Voltage is specified in the assigned Distribution System)."

## Syntax (C#)
```csharp
public static FailureDefinitionId VoltageIsOutOfRange { get; }
```